       IDENTIFICATION DIVISION.
       PROGRAM-ID. VAR.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 USERNAME PIC A(16).
       01 AGE PIC ZZZ.
       01 BIRTHDAY PIC X(10).

       PROCEDURE DIVISION.
           DISPLAY "WHAT IS YOUR NAME?".
           ACCEPT USERNAME FROM SYSIN.
           DISPLAY "WHAT IS YOUR AGE?".
           ACCEPT AGE FROM SYSIN.
           DISPLAY "WHAT IS YOUR BIRTHDAY?".
           ACCEPT BIRTHDAY FROM SYSIN.
           DISPLAY " ".
           DISPLAY "YOUR NAME IS    : "USERNAME.
           DISPLAY "YOUR AGE IS     : "AGE.
           DISPLAY "YOUR BIRTHDAY IS:"BIRTHDAY.

