IDENITIFICATION DIVISION.
PROGRAM-ID. USRINP.

ENVIRONMENT DIVSION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 USERINPUT PIC X(10).

PROCEDURE DIVSION.
  ACCEPT USERINPUT FROM SYSIN.
  DISPLAY USERINPUT.
  STOP RUN.
