       IDENTIFICATION DIVISION.
       PROGRAM-ID. USRINP.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 USERINPUT PIC X(10).

       PROCEDURE DIVISION.
           ACCEPT USERINPUT FROM SYSIN.
           DISPLAY USERINPUT.
           STOP RUN.
